app/controllers/students_controller.rb

    def update
        @student = Student.find(params[:id])
        @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Test (Updated)"], ["updated_at", "2020-10-28 01:27:32.325848"], ["id", 4]]